#### Terraform Format and Style :pencil2: :white_check_mark: **Success**
#### Terraform Validate :hammer_and_wrench: :white_check_mark: **Success**
#### TFLint Check :shirt: :white_check_mark: **Success**
#### Trivy Scan :shield: :white_check_mark: **Success**
#### Terraform Plan :page_facing_up: :white_check_mark: **Success**
---
### Terraform Plan
<details><summary>Click to expand</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.codedeploy.aws_codedeploy_app.my_app will be created
  + resource "aws_codedeploy_app" "my_app" {
      + application_id      = (known after apply)
      + arn                 = (known after apply)
      + compute_platform    = "ECS"
      + github_account_name = (known after apply)
      + id                  = (known after apply)
      + linked_to_github    = (known after apply)
      + name                = "sample-prod-frontend-app"
      + tags_all            = {
          + "iac" = "terraform"
        }
    }

  # module.codedeploy.aws_codedeploy_deployment_group.my_deployment_group will be created
  + resource "aws_codedeploy_deployment_group" "my_deployment_group" {
      + app_name                    = "sample-prod-frontend-app"
      + arn                         = (known after apply)
      + compute_platform            = (known after apply)
      + deployment_config_name      = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id         = (known after apply)
      + deployment_group_name       = "example"
      + id                          = (known after apply)
      + outdated_instances_strategy = "UPDATE"
      + service_role_arn            = (known after apply)
      + tags_all                    = {
          + "iac" = "terraform"
        }

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + blue_green_deployment_config {
          + deployment_ready_option {
              + action_on_timeout = "CONTINUE_DEPLOYMENT"
            }
          + green_fleet_provisioning_option (known after apply)
          + terminate_blue_instances_on_deployment_success {
              + action                           = "TERMINATE"
              + termination_wait_time_in_minutes = 5
            }
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "BLUE_GREEN"
        }

      + ecs_service {
          + cluster_name = "sample-prod-frontend-ecs-cluster"
          + service_name = "sample-prod-frontend-svc"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/sample-prod-frontend-ecs-alb/fdfbfe873bf70aa3/8256ba5a9dba09c0",
                    ]
                }
              + target_group {
                  + name = "webecs20240821044609481000000008"
                }
              + target_group {
                  + name = "webecs20240821044609490300000009"
                }
              + test_traffic_route {
                  + listener_arns = [
                      + "arn:aws:elasticloadbalancing:ap-northeast-1:551748907504:listener/app/sample-prod-frontend-ecs-alb/fdfbfe873bf70aa3/9db2ea11b8782c61",
                    ]
                }
            }
        }
    }

  # module.codedeploy.aws_iam_role.codedeploy_service_role will be created
  + resource "aws_iam_role" "codedeploy_service_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "codedeploy.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sample-prod-frontend-codedeploy-service-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "iac" = "terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.codedeploy.aws_iam_role_policy_attachment.AWSCodeDeployRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSCodeDeployRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSCodeDeployRoleForECS"
      + role       = "sample-prod-frontend-codedeploy-service-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>